Revit 2027 API
Document.CombineElements Method
Combine a set of combinable elements into a geometry combination.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeomCombination CombineElements(
	CombinableElementArray members
)
Public Function CombineElements (
	members As CombinableElementArray
) As GeomCombination
public:
GeomCombination^ CombineElements(
	CombinableElementArray^ members
)
member CombineElements :
        members : CombinableElementArray -> GeomCombination
Parameters
members CombinableElementArray
A list of combinable elements to be combined.
Return Value
GeomCombination
If successful, the newly created geometry combination is returned, otherwise an exception with error information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument is null.
ArgumentException |  Thrown when members contains less than two elements. Thrown when members contains null elements.
InvalidOperationException |  Thrown when creation of the combination failed.
Remarks
If one or more existing geometry combinations are included as input, the return value may be one of those pre-existing combinations. The rest of the pre-existing geometry combinations will be consumed into the new combination; those handles are no longer valid.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace